In [1]:
import pandas as pd
import numpy as np

In [2]:
# создадим несколько списков и массивов Numpy с информацией о семи странах мира
country = np.array(['China', 'Vietnam', 'United Kingdom', 'Russia', 'Argentina', 'Bolivia', 'South Africa'])
capital = ['Beijing', 'Hanoi', 'London', 'Moscow', 'Buenos Aires', 'Sucre', 'Pretoria']
population = [1400, 97, 67, 144, 45, 12, 59] # млн. человек
area = [9.6, 0.3, 0.2, 17.1, 2.8, 1.1, 1.2] # млн. кв. км.
sea = [1] * 5 + [0, 1] # выход к морю (в этом списке его нет только у Боливии)
 
# кроме того создадим список кодов стран, которые станут индексом датафрейма
custom_index = ['CN', 'VN', 'GB', 'RU', 'AR', 'BO', 'ZA']
 
# создадим пустой словарь
countries_dict = {}
 
# превратим эти списки в значения словаря,
# одновременно снабдив необходимыми ключами
countries_dict['country'] = country
countries_dict['capital'] = capital
countries_dict['population'] = population
countries_dict['area'] = area
countries_dict['sea'] = sea
 
# создадим датафрейм
countries = pd.DataFrame(countries_dict, index = custom_index)
countries

           country       capital  population  area  sea
CN           China       Beijing        1400   9.6    1
VN         Vietnam         Hanoi          97   0.3    1
GB  United Kingdom        London          67   0.2    1
RU          Russia        Moscow         144  17.1    1
AR       Argentina  Buenos Aires          45   2.8    1
BO         Bolivia         Sucre          12   1.1    0
ZA    South Africa      Pretoria          59   1.2    1

### __Копирование DataFrame__

__Метод .copy()__

In [3]:
# Вначале создадим копию датафрейма с помощью простого присвоения этого объекта новой переменной.
countries_new = countries

In [4]:
# удалим строку с данными про Аргентину и выведем исходный DataFrame
countries_new.drop(labels = 'AR', axis = 0, inplace = True)
countries

           country   capital  population  area  sea
CN           China   Beijing        1400   9.6    1
VN         Vietnam     Hanoi          97   0.3    1
GB  United Kingdom    London          67   0.2    1
RU          Russia    Moscow         144  17.1    1
BO         Bolivia     Sucre          12   1.1    0
ZA    South Africa  Pretoria          59   1.2    1

__inplace__

In [5]:
df = pd.DataFrame([[1, 1, 1],
                   [2, 2, 2],
                   [3, 3, 3]],
                  columns = ['A', 'B', 'C'])

df

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3

In [6]:
# попробуем удалить столбец A
df.drop(labels = ['A'], axis = 1, inplace = False)

   B  C
0  1  1
1  2  2
2  3  3

In [7]:
# проверим сохранилось ли изменение 
df

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3

In [8]:
# если метод выдает None, изменение постоянно
# изменим параметр inplace на True 
df.drop(labels = ['A'], axis = 1, inplace = True)

In [9]:
df

   B  C
0  1  1
1  2  2
2  3  3

In [10]:
# нельзя использовать inplace = True, и записывать результат в переменную одновременно
df = df.drop(labels = ['B'], axis = 1, inplace = True)
print(df)

None

### __Столбцы DataFrame__

__Именнование столбцов при создании DataFrame__